Revit 2027 API
VendorIdAttribute Constructor
Constructs a new VendorIdAttribute.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VendorIdAttribute(
	string vendorIdStr
)
Public Sub New (
	vendorIdStr As String
)
public:
VendorIdAttribute(
	String^ vendorIdStr
)
new :
        vendorIdStr : string -> VendorIdAttribute
Parameters
vendorIdStr String
See Also
Reference
VendorIdAttribute Class
Autodesk.Revit.DB.Macros Namespace